In [1]:
import pandas as pd
import numpy as np

In [2]:
dict_series = {
    "one": pd.Series([1.0, 2.0, 3.0], index=["a", "b", "c"]),
    "two": pd.Series([1.0, 2.0, 3.0, 4.0], index=["a", "b", "c", "d"]),
}

In [3]:
df_dict_series = pd.DataFrame(dict_series)

In [4]:
df_dict_series

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [5]:
df_dict_series.loc["a","one"]

1.0

In [6]:
df_dict_series.loc["a","two"]

1.0

In [7]:
df_dict_series.loc["a":"c"]

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0

In [8]:
df_dict_series.loc["a":]

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [9]:
df_dict_series.iloc[0,0]

1.0

In [10]:
df_dict_series.loc["a","one"]

1.0

In [10]:
dates = pd.date_range('1/1/2000', periods=8)

In [11]:
df_dates = pd.DataFrame(np.random.randn(8, 4),
                  index=dates, columns=['A', 'B', 'C', 'D'])

In [12]:
df_dates

                   A         B         C         D
2000-01-01 -1.904450 -0.702324  1.064775 -2.217032
2000-01-02  0.476575 -0.207584 -0.659859 -1.183510
2000-01-03 -0.208827 -1.650269  2.038913 -0.925695
2000-01-04  0.213676  0.718196 -1.837653  0.718649
2000-01-05  1.838012 -0.063860  0.860443  1.905842
2000-01-06  0.468479  0.205710 -1.836769 -0.841850
2000-01-07  1.199886  0.253992  0.430768  0.907093
2000-01-08  0.281926 -0.791547 -1.200337  0.594320

In [13]:
df_dates[["A","B"]]

                   A         B
2000-01-01 -1.904450 -0.702324
2000-01-02  0.476575 -0.207584
2000-01-03 -0.208827 -1.650269
2000-01-04  0.213676  0.718196
2000-01-05  1.838012 -0.063860
2000-01-06  0.468479  0.205710
2000-01-07  1.199886  0.253992
2000-01-08  0.281926 -0.791547

In [14]:
df_dates.loc[df_dates.index[[0,1]],["A","B"]] #Combining positional and label-based indexing

                   A         B
2000-01-01 -1.904450 -0.702324
2000-01-02  0.476575 -0.207584

In [15]:
df_dates.index[[0,1]]

DatetimeIndex(['2000-01-01', '2000-01-02'], dtype='datetime64[ns]', freq=None)

In [7]:
df_invers= pd.DataFrame(
    {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)
df_invers

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [8]:
df_invers.loc[1] # .loc used with index integer location of row

AAA     5
BBB    20
CCC    50
Name: 1, dtype: int64

In [26]:
df_invers[~((df_invers.AAA <= 6) & (df_invers.index.isin([0, 2, 4])))]

   AAA  BBB  CCC
1    5   20   50
3    7   40  -50

In [27]:
ser = pd.Series(range(3), index=list("abc"), name="ser")

In [28]:
ser

a    0
b    1
c    2
Name: ser, dtype: int64

In [29]:
df_ser = pd.DataFrame(ser)

In [30]:
df_dates[::]

                   A         B         C         D
2000-01-01  1.089728 -1.687532 -0.650433  0.365239
2000-01-02  1.427633  0.009848 -0.576438 -0.985365
2000-01-03 -0.462729 -0.244983 -0.512938 -0.816723
2000-01-04 -1.436091  1.806820  1.497367 -1.001206
2000-01-05  1.333940 -0.297456  0.270063  0.332574
2000-01-06 -0.016028 -0.670600  0.093425  0.007713
2000-01-07  1.756204  0.451360 -2.230776 -1.361208
2000-01-08  0.488318  0.371813 -0.101681 -0.045553

In [31]:
ser1 = pd.Series(range(3,6), index=list("abc"), name="ser1")

In [32]:
ser1

a    3
b    4
c    5
Name: ser1, dtype: int64

In [34]:
df_ser["ser1"]=ser1

In [35]:
df_ser

   ser  ser1
a    0     3
b    1     4
c    2     5

In [36]:
df_ser.pop("ser")

a    0
b    1
c    2
Name: ser, dtype: int64

In [37]:
df_ser

   ser1
a     3
b     4
c     5

In [38]:
df_ser.insert(1,"new_ser1",df_ser["ser1"])

In [39]:
df_ser

   ser1  new_ser1
a     3         3
b     4         4
c     5         5

In [40]:
df_ser.insert(1,"new_ser2",df_ser["ser1"])

In [41]:
df_ser

   ser1  new_ser2  new_ser1
a     3         3         3
b     4         4         4
c     5         5         5

In [42]:
df_ser.insert(0,"new_ser4",df_ser["ser1"])

In [43]:
df_ser

   new_ser4  ser1  new_ser2  new_ser1
a         3     3         3         3
b         4     4         4         4
c         5     5         5         5

In [44]:
df_ser.sort_index(axis=1)

   new_ser1  new_ser2  new_ser4  ser1
a         3         3         3     3
b         4         4         4     4
c         5         5         5     5

In [45]:
df_ser.loc[:,'ser2'] = df_ser["ser1"] # Add new column

In [46]:
df_ser

   new_ser4  ser1  new_ser2  new_ser1  ser2
a         3     3         3         3     3
b         4     4         4         4     4
c         5     5         5         5     5

In [38]:
df_ser.loc['d']=[1,2,3,4,5] # Add new row

In [40]:
df_ser

   new_ser4  ser1  new_ser2  new_ser1  ser2
a         3     3         3         3     3
b         4     4         4         4     4
c         5     5         5         5     5
d         1     2         3         4     5

In [42]:
df_ser_1 = df_ser.copy()

In [45]:
df_ser_1.set_index("ser2")

      new_ser4  ser1  new_ser2  new_ser1
ser2
3            3     3         3         3
4            4     4         4         4
5            5     5         5         5
5            1     2         3         4

# Conditional Selection

In [47]:
df_dict_series

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [9]:
df_dict_series.loc[df_dict_series["one"]==1] # the row with colomn "one" equal 1

   one  two
a  1.0  1.0

In [48]:
df_dict_series["one"]==1

a     True
b    False
c    False
d    False
Name: one, dtype: bool

In [10]:
df_dict_series.loc[df_dict_series["one"] > 1] # the row with colomn "one" bigger than 1

   one  two
b  2.0  2.0
c  3.0  3.0

In [11]:
df_dict_series.loc[(df_dict_series.one> 1)&(df_dict_series.one == 2)] # the row with two conditions both met

   one  two
b  2.0  2.0

In [12]:
df_dict_series.loc[(df_dict_series.one> 1)|(df_dict_series.one == 2)] # the row with two conditions either meets

   one  two
b  2.0  2.0
c  3.0  3.0

In [14]:
df_dict_series.loc[~(df_dict_series["one"] > 1)] # the row without colomn "one" bigger than 1

   one  two
a  1.0  1.0
d  NaN  4.0

In [16]:
df_dict_series.loc[df_dict_series["two"].isin([3,4])] # the row with colomn "two" has 3 or 4

   one  two
c  3.0  3.0
d  NaN  4.0

In [17]:
df_dict_series.loc[df_dict_series["one"].notnull()] # the row with colomn "one" 's value is not null

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0

In [ ]:
df_dict_series

# Iteration

In [16]:
df = pd.DataFrame({'num_legs': [4, 2], 'num_wings': [0, 2]},
                  index=['dog', 'hawk'])

In [17]:
df

      num_legs  num_wings
dog          4          0
hawk         2          2

In [32]:
for row in df.itertuples():  # df.itertuples() return each row as a nametuple,you can access each row with: _fields,.column_name
    print(row._fields)
    print(row)

('Index', 'num_legs', 'num_wings')
Pandas(Index='dog', num_legs=4, num_wings=0)
('Index', 'num_legs', 'num_wings')
Pandas(Index='hawk', num_legs=2, num_wings=2)

# query()

In [16]:
n=10
df = pd.DataFrame(np.random.randint(n, size=(n, 3)), columns=list('abc'))

In [17]:
df

   a  b  c
0  2  6  6
1  3  7  9
2  5  6  0
3  4  1  6
4  4  1  0
5  2  5  5
6  8  6  5
7  0  5  7
8  9  8  3
9  4  1  0

In [18]:
df[(df['a'] > df['b']) & (df['b'] < df['c'])]

   a  b  c
3  4  1  6

In [19]:
df.query('(a > b) & (b < c)')

   a  b  c
3  4  1  6

In [20]:
df.query('(a > b) and (b < c)')

   a  b  c
3  4  1  6

In [2]:
df = pd.DataFrame({'a': list('aabbccddeeff'), 'b': list('aaaabbbbcccc'),
                   'c': np.random.randint(5, size=12),
                   'd': np.random.randint(9, size=12)})
df

    a  b  c  d
0   a  a  4  2
1   a  a  4  0
2   b  a  0  7
3   b  a  0  1
4   c  b  1  1
5   c  b  0  2
6   d  b  2  5
7   d  b  3  1
8   e  c  4  2
9   e  c  3  5
10  f  c  0  0
11  f  c  4  8

In [3]:
df[df['a'].isin(df['b'])]  # the row of column a element can be found in column b, so from row 6 to 11, column a element is not in column b

   a  b  c  d
0  a  a  4  2
1  a  a  4  0
2  b  a  0  7
3  b  a  0  1
4  c  b  1  1
5  c  b  0  2

In [30]:
df.query('a in b')

   a  b  c  d
0  a  a  2  7
1  a  a  1  7
2  b  a  3  7
3  b  a  1  4
4  c  b  1  7
5  c  b  3  1

In [36]:
df = pd.DataFrame(np.random.randint(n, size=(n, 2)), columns=list('bc'))
df

   b  c
0  3  6
1  8  7
2  4  6
3  3  2
4  6  3
5  8  7
6  4  5
7  4  7
8  0  4
9  9  9

In [37]:
df.query('index < b < c')

   b  c
0  3  6
2  4  6